# MPG Cars

### Introduction:

The following exercise utilizes data from [UC Irvine Machine Learning Repository](https://archive.ics.uci.edu/ml/datasets/Auto+MPG)

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd 
import numpy as np

### Step 2. Import the first dataset [cars1](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars1.csv) and [cars2](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars2.csv).

   ### Step 3. Assign each to a variable called cars1 and cars2

In [2]:
cars1 = pd.read_csv('./cars1.csv')
cars2 = pd.read_csv('./cars2.csv')
cars1.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12,Unnamed: 13
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu,NaN,NaN,NaN,NaN,NaN
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320,NaN,NaN,NaN,NaN,NaN
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite,NaN,NaN,NaN,NaN,NaN
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst,NaN,NaN,NaN,NaN,NaN
4,17.0,8,302,140,3449,10.5,70,1,ford torino,NaN,NaN,NaN,NaN,NaN

In [3]:
cars2.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
0,33.0,4,91,53,1795,17.4,76,3,honda civic
1,20.0,6,225,100,3651,17.7,76,1,dodge aspen se
2,18.0,6,250,78,3574,21.0,76,1,ford granada ghia
3,18.5,6,250,110,3645,16.2,76,1,pontiac ventura sj
4,17.5,6,258,95,3193,17.8,76,1,amc pacer d/l

### Step 4. Ops it seems our first dataset has some unnamed blank columns, fix cars1

In [4]:
cars1.columns

Index(['mpg', 'cylinders', 'displacement', 'horsepower', 'weight',
       'acceleration', 'model', 'origin', 'car', 'Unnamed: 9', 'Unnamed: 10',
       'Unnamed: 11', 'Unnamed: 12', 'Unnamed: 13'],
      dtype='object')

In [5]:
cars1 = cars1.loc[:,'mpg':'car']
cars1.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302,140,3449,10.5,70,1,ford torino

### Step 5. What is the number of observations in each dataset?

In [6]:
print(cars1.shape)
print(cars2.shape)

(198, 9)
(200, 9)

### Step 6. Join cars1 and cars2 into a single DataFrame called cars

In [7]:
cars = cars1.append(cars2)
cars.shape

(398, 9)

### Step 7. Ops there is a column missing, called owners. Create a random number Series from 15,000 to 73,000.

In [9]:
owners = np.random.randint(15000,73000,size = 398)
owners

array([49271, 38370, 71468, 33741, 55734, 57449, 32488, 42898, 26905,
       55514, 25429, 29536, 38829, 29696, 62171, 52294, 59159, 71997,
       65172, 71403, 40610, 37062, 40481, 66532, 55189, 37670, 34497,
       59674, 45384, 34368, 72527, 61486, 22747, 72920, 70048, 42077,
       17594, 27978, 49289, 51900, 61396, 46412, 36580, 64512, 26541,
       25979, 17948, 43706, 55224, 34372, 24133, 22166, 44973, 49345,
       62829, 47102, 30417, 38992, 64879, 67553, 21220, 22558, 70135,
       55001, 36096, 36625, 17896, 45569, 62414, 15687, 31540, 72112,
       41571, 19253, 57688, 34514, 45683, 21406, 63203, 43607, 51495,
       19621, 44857, 30444, 23951, 27909, 42815, 51813, 55217, 59405,
       65830, 15432, 71734, 54422, 41083, 26030, 55248, 26154, 15291,
       57773, 15418, 30279, 16838, 17632, 45040, 68898, 64736, 52743,
       71223, 24732, 39295, 59714, 58266, 41517, 54393, 65986, 64142,
       66701, 67193, 56889, 19881, 16465, 27679, 56638, 55759, 16853,
       17824, 43916, 29492, 28954, 48711, 16422, 38241, 40931, 61886,
       32735, 54485, 29678, 22572, 32109, 20470, 27650, 66667, 19777,
       71142, 61459, 48625, 53685, 63938, 37848, 47772, 58690, 29588,
       40217, 36348, 47414, 31856, 33919, 48934, 21162, 70717, 66243,
       50340, 39271, 26722, 41403, 52980, 59453, 23104, 37174, 28012,
       72944, 33690, 33760, 32039, 54134, 59930, 31551, 62787, 70655,
       31849, 54142, 25992, 31961, 54122, 17336, 49879, 26351, 49849,
       20099, 34811, 46700, 17537, 26802, 66824, 25074, 39505, 38590,
       55351, 65505, 57163, 34563, 55606, 37744, 71527, 48163, 68075,
       64293, 22544, 60215, 16424, 40223, 31027, 45055, 28688, 58819,
       44142, 50881, 46382, 42896, 20224, 69933, 62663, 41006, 36291,
       54948, 68217, 71430, 23733, 33532, 50280, 38905, 48946, 36186,
       46238, 28683, 42195, 52541, 71156, 35682, 46979, 17484, 43798,
       36001, 71134, 42655, 65259, 31503, 28502, 27456, 48815, 65169,
       39325, 18919, 26323, 68730, 62319, 43053, 46406, 68243, 56610,
       16937, 63920, 18503, 53625, 43942, 49490, 32317, 42520, 28059,
       58646, 40240, 59486, 38674, 47588, 59317, 56025, 41887, 66209,
       18790, 35549, 53107, 50782, 22382, 45338, 54654, 29851, 66280,
       32588, 60103, 15130, 19853, 51286, 48276, 51057, 61706, 25182,
       60809, 25297, 28491, 42585, 47332, 30366, 48226, 24741, 55394,
       44966, 21747, 64303, 60346, 24939, 43270, 68610, 55025, 41725,
       28122, 31364, 18982, 58626, 28374, 61095, 70820, 46099, 65558,
       67885, 45941, 36488, 29931, 63937, 70791, 42664, 29555, 39936,
       66869, 66072, 69972, 63522, 30880, 35855, 38797, 25808, 41189,
       40735, 24754, 60012, 48666, 54961, 40668, 39144, 16809, 20094,
       30380, 55519, 41454, 28508, 63430, 56805, 70305, 33581, 25905,
       18551, 47640, 51818, 24627, 61771, 24207, 42910, 15227, 41883,
       54467, 60155, 53371, 57217, 19635, 56591, 46240, 39332, 38035,
       67162, 63145, 53929, 51946, 52831, 66979, 58085, 20199, 58004,
       24990, 21275, 41236, 37314, 31907, 47471, 61485, 24388, 60373,
       18845, 67501])

### Step 8. Add the column owners to cars

In [15]:
cars['owners']=owners
print(cars.columns)
cars.head()

Index(['mpg', 'cylinders', 'displacement', 'horsepower', 'weight',
       'acceleration', 'model', 'origin', 'car', 'owners'],
      dtype='object')

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car,owners
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu,49271
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320,38370
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite,71468
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst,33741
4,17.0,8,302,140,3449,10.5,70,1,ford torino,55734